Repository: frirenomg/Student_Registration_System
Catalog: locale/*/LC_MESSAGES/django.po
Languages: kk

source: Student Registration System
kk: Студенттерді тіркеу жүйесі

source: Manage student profiles efficiently
kk: Студенттердің профильдерін тиімді басқарыңыз

source: Student Filters
kk: Студенттерді сүзгілеу

source: Student ID
kk: Студент ID

source: Filter by ID...
kk: ID бойынша сүзгілеу...

source: IIN
kk: ЖСН

source: Filter by IIN...
kk: ЖСН бойынша сүзгілеу...

source: First Name
kk: Аты

source: Filter by first name...
kk: Аты бойынша сүзгілеу...

source: Last Name
kk: Тегі

source: Filter by last name...
kk: Тегі бойынша сүзгілеу...

source: Group
kk: Топ

source: Filter by group...
kk: Топ бойынша сүзгілеу...

source: Phone
kk: Телефон

source: Filter by phone...
kk: Телефон бойынша сүзгілеу...

source: Reset Filters
kk: Сүзгілерді тазарту

source: Create New Profile
kk: Жаңа профиль жасау

source: Student Photo
kk: Студенттің фотосы

source: No Photo
kk: Фотосурет жоқ

source: Student ID:
kk: Студент ID:

source: IIN:
kk: ЖСН:

source: Group:
kk: Тобы:

source: View Details
kk: Толығырақ көру

source: No students found.
kk: Студенттер табылған жоқ.

source: No students found matching your filters.
kk: Сүзгілерге сәйкес студенттер табылмады.
